[
    {
        "product_title": "ESR for iPhone 16 Pro Max Case, Compatible with MagSafe, Shockproof Military-Grade Protection, Magnetic Phone Case for iPhone 16 Pro Max 6.9 inch, Clear",
        "img_url": "https://m.media-amazon.com/images/I/41GZXpUjx2L._AC_US60_SCLZZZZZZZ__.jpg",
        "reviews": [
            {
                "review_title": "5.0 out of 5 stars\nNOT SLIPPERY!",
                "reviewer_name": "SeaJoh",
                "review_date": "Reviewed in the United States on October 20, 2024",
                "review_text": "Clear case that looks great and highlights the existing color of my iphone 16 pro. Tight fit, all the openings align to the buttons, corner bumpers, ridge to protect the lenses, mag works and is strong, (sorry not drop testing it seems protective), and best of all it is NOT SLIPPERY like so many of these other clear cases. It has a good grip to it. For the price? I love it so far. Perfect for my needs."
            },
            {
                "review_title": "5.0 out of 5 stars\nMust-Have Case for iPhone 16 Pro Max! Perfectly MagSafe-Compatible!",
                "reviewer_name": "Dennis Schleicher",
                "review_date": "Reviewed in the United States on October 10, 2024",
                "review_text": "The media could not be loaded.\n                \n\n\n\nI recently got my hands on the iPhone 16 Pro Max MagSafe Case, and let me tell you, it’s an absolute game-changer! If you’re like me and want to protect your investment without sacrificing style or functionality, this case is the one to get.The design is sleek, minimalistic, and feels premium in hand. It’s slim yet offers incredible protection, thanks to the reinforced edges and shock-absorbing materials. I was particularly impressed by how light it feels for such a durable case. But where this case really shines is in its MagSafe compatibility. I’ve tested it with my MagSafe charger, car mount, and even my MagSafe wallet, and everything snaps into place perfectly. Charging through the case is a breeze, and you can feel that strong magnetic connection every time. No more fumbling or adjusting—just snap and go!I’m always worried about dropping my phone, but this case gives me peace of mind. The raised bezels around the camera and screen add an extra layer of protection, ensuring that both stay scratch-free. Plus, I’ve had a few accidental drops already, and my phone came out unscathed. It’s definitely durable, yet slim enough to fit in your pocket easily. One thing I hate is a bulky case, but this one fits the iPhone 16 Pro Max like a glove, giving you full access to all the buttons and ports without any awkward spacing. The buttons are super responsive, and the case doesn’t interfere with wireless charging or wired connections at all.If you’re looking for a high-quality, protective, and MagSafe-compatible case for your iPhone 16 Pro Max, this is it. It’s stylish, functional, and offers unmatched protection. You won’t regret it. Check out the video to see how easy the MagSafe features are to use and why this case is a must-have for any iPhone 16 Pro Max user!~ Dennis Schleicher"
            },
            {
                "review_title": "5.0 out of 5 stars\nAwesome phone case!",
                "reviewer_name": "Amazon Customer",
                "review_date": "Reviewed in the United States on October 14, 2024",
                "review_text": "It’s durable and sleek. And I like that their edges match the color of my phone but the back is clear so you can see the color of my phone itself. The MagSafe Manet is also very strong and works great with my battery pack. Awesome case for the price!"
            },
            {
                "review_title": "5.0 out of 5 stars\nReally nice!",
                "reviewer_name": "Missy",
                "review_date": "Reviewed in the United States on October 19, 2024",
                "review_text": "This case looks great and fits the phone perfectly. It is very sturdy and the magnets are strong! I don’t know about yellowing, because I haven’t had it long enough to see yet, but going by the quality of the case, I’m extremely optimistic that yellowing will not be an issue. Definitely worth the money!"
            },
            {
                "review_title": "4.0 out of 5 stars\nGreat Protection with Sleek Design and MagSafe Compatibility",
                "reviewer_name": "Darshil",
                "review_date": "Reviewed in the United States on October 8, 2024",
                "review_text": "The ESR Classic Hybrid Case for iPhone 16 Pro Max offers a great balance of protection and MagSafe functionality. I’ve been using it for a few weeks now, and overall, I’m quite impressed with the design and build quality. The clear back allows the beauty of the iPhone 16 Pro Max to shine through while providing military-grade shockproof protection, which gives me peace of mind when I accidentally drop my phone.The case fits snugly, ensuring that all buttons and ports are easily accessible. It doesn’t add too much bulk to the phone, which is a big plus for me since I prefer a slim, minimalist profile. The raised edges around the screen and camera offer extra protection, and the clear material hasn’t yellowed yet, which is often a problem with clear cases.MagSafe compatibility is another highlight. The HaloLock magnetic feature is strong and works perfectly with my MagSafe charger and other accessories. The magnetic connection is reliable, and my phone charges quickly without having to adjust the position.However, one minor issue I’ve noticed is that the case can become slightly slippery, especially when my hands are wet or sweaty. Also, while the case offers good drop protection, it doesn't feel as rugged as some heavy-duty cases. But if you’re looking for a protective yet stylish case that shows off your iPhone's design, this ESR case is a solid choice.Overall, it’s a great case with a few minor drawbacks. Four stars!"
            },
            {
                "review_title": "5.0 out of 5 stars\nNice case",
                "reviewer_name": "Alex R",
                "review_date": "Reviewed in the United States on October 13, 2024",
                "review_text": "I’m really pleased with this case. I ordered the case immediately after my preorder for the iPhone 16 Pro. When my phone arrived, the case slipped right on. It doesn’t interfere with the buttons and the MagSafe ring is solid. If I had a complaint (and I use that term loosely) it would be that the camera protector protrudes considerably. I had to buy a MagSafe compatible dock for my nightstand, as my existing wireless charging dock that worked for my iPhone 11 Pro did not work for this phone/case because of how far the camera protector sticks out. No big deal. I was probably due to get with the MagSafe program anyway. The case does its job well. I especially like the low profile and the bumpers on each corner for added protection."
            },
            {
                "review_title": "5.0 out of 5 stars\nGreat case",
                "reviewer_name": "Nick McCarty",
                "review_date": "Reviewed in the United States on October 23, 2024",
                "review_text": "Good fit, is clear as advertised, feels and looks like quality, has already survived a drop from about 5 feet, is easy to put on/off and clean. Would recommend."
            },
            {
                "review_title": "5.0 out of 5 stars\nReally Great iPhone 15 Pro Max Case!",
                "reviewer_name": "TexasMarine89 - Amazon Customer",
                "review_date": "Reviewed in the United States on October 22, 2024",
                "review_text": "What I really like about this case is its durability and its color options and shows off the actual color of the iPhone. But this biggest Plus about this case is its complete compatibility with Mag Safe! Great case! For a Great Price. Highly Recommend this Case!"
            },
            {
                "review_title": "5.0 out of 5 stars\nESR iPhone 16 Plus Case: The Shockwave of Military-Grade Protection You Didn’t Know You Needed",
                "reviewer_name": "Mark Fowler",
                "review_date": "Reviewed in the United States on October 11, 2024",
                "review_text": "Imagine this: your iPhone 16 Plus is more than just a phone—it’s a mission-critical device, and ESR is the elite shield that makes sure your beloved gadget doesn’t just survive—it THRIVES in the chaos. We’re not talking about your run-of-the-mill phone case here; this is a tactical masterpiece engineered for those who live life on the edge (or at least near coffee table edges). When you slap this bad boy on your phone, it’s like handing it an impenetrable suit of armor, forged from the fires of a blockbuster movie where explosions are a form of punctuation.[Compatible with MagSafe: Magnetic Marvel] We’ve seen the future of accessories, and it snaps, twists, and locks in place like a magnetic warrior ready for action. With the ESR case, your MagSafe accessories don’t just connect—they magnetically bond like they’re gearing up for a high-speed chase sequence. Your phone could practically double as a stunt driver in a heist movie. Clip on that wallet, stick on that charger, and keep your gear close at hand while you dive into your next high-octane adventure.[Shock of Military-Grade Protection: The Kind That Laughs in the Face of Danger] Let’s be clear: this is not just any protection; it’s military-grade shock absorption. Picture your phone encased in a barrier so resilient it could survive being launched out of a fighter jet and landing on the pavement below. You know those epic slow-motion scenes where the hero walks away from an explosion without a scratch? That’s your phone, strutting away from drops, shocks, and spills with swagger.The ESR iPhone 16 Plus case eats impacts for breakfast. BOOM—it takes the hit like a champ and asks for seconds. Its shock-absorbing technology doesn’t merely reduce the impact; it decimates it. Every accidental drop or bump is an opportunity for this case to show off its indestructibility.[Design: Sleekness Meets Brute Force] This case doesn’t just look good—it looks like it belongs in a display case at an action movie museum. The contours wrap your iPhone like a second skin, creating a seamless combination of sleek aesthetics and reinforced ruggedness. It’s like if a stealth fighter and a luxury sports car had a love child that decided to moonlight as a phone case.The tactical buttons, precise cutouts, and grippy texture all combine to make your iPhone 16 Plus feel like the tech equivalent of an elite operative. Think James Bond, but instead of a tuxedo, it’s dressed in reinforced armor, and instead of a Walther PPK, it’s got MagSafe capability.[Grip Like a Gladiator] In a world where fumbles can lead to disaster, the ESR case offers grip so steadfast it practically fuses to your hand. Imagine gripping the hilt of Excalibur or scaling a cliff face with just your fingertips. This isn’t just a phone case—it’s a partnership with your palm that makes sure your iPhone never slips away when the stakes are high, like mid-text while crossing the street.[Camera Guard Technology: Lights, Camera, Unscathed!] Every phone photographer knows the real enemy isn’t bad lighting—it’s scratches. Enter ESR’s Camera Guard Technology, stepping in like a superhero to shield those precious lenses from harm’s way. This isn’t just a lip around your camera; it’s a fortress. You could be taking photos in the middle of a sandstorm or dodging rogue action figures, and your camera would still be ready for its close-up.[Built for Adventure, Born for Drama] Whether you’re scaling mountains, slaying inboxes, or surviving coffee spills, this case will be your trusty companion. It’s like having an action movie sidekick that saves the day and still looks amazing while doing it. The ESR case doesn’t just protect your phone; it dares life to throw its worst. It’s for the thrill-seekers, the world-changers, and those who just can’t help but accidentally drop their phones.[Conclusion: The Ultimate Action Movie for Your iPhone] The ESR iPhone 16 Plus Case is not merely an accessory; it’s a statement. It’s a ticket to the greatest show on Earth where your phone comes out of every drop, bump, and scrape unscathed. When they say \"military-grade,\" they’re not kidding. This case has seen battle, won, and had time to flex for the cameras afterward. It’s shockproof, MagSafe compatible, and stylish enough to turn heads faster than a high-speed chase.Get ready to transform your phone into the main character of its own action-packed saga. The ESR iPhone 16 Plus Case isn’t just along for the ride—it’s leading the charge into a world where accidents are just another chance for your phone to prove its invincibility. This case is the action movie star of phone accessories, and your iPhone is about to win Best Protected Device of the Year."
            },
            {
                "review_title": "5.0 out of 5 stars\nExactly the same as the OEM I phone case",
                "reviewer_name": "R",
                "review_date": "Reviewed in the United States on October 21, 2024",
                "review_text": "If you like the clear OEM Iphone case then buy this go to the store and look at the price there and be HAPPY. LOL, You just bought the same case for less than half of the OEM case.  The magnet is strong the case is rugged and provides protection is clear easy to take on and off. Buttons are good and the right location all in all, a winner. The magnet is strong and will hold to any of the accessories. I don't happen to like that since I have the travel charger at my bedside and cannot remove it easily from the charger. So I bought a case without the magnet like I had. I wish they would give you the option on this case to either have the magnets or not, but they don't and the magnets cannot be removed. The case is so well made you cannot even feel the magnets either. The case to me has the exact amount of grip also not to much or to little."
            },
            {
                "review_title": "5.0 out of 5 stars\nGood case",
                "reviewer_name": "D",
                "review_date": "Reviewed in the United States on October 5, 2024",
                "review_text": "I wanted a clear case to show off my phone color. I have already dropped my phone on the ground a few times since I have got it including face down and my phone has been great. No breaks. It is light and the grip is good. It doesn’t slip out of my hand."
            },
            {
                "review_title": "4.0 out of 5 stars\nLesson learned: \"Military-Grade protection\"  does not include an cover over either screen or lenses.",
                "reviewer_name": "Poor Richard",
                "review_date": "Reviewed in the United States on October 2, 2024",
                "review_text": "I have clearly fallen behind on the iPhone zeitgeist. I assumed that \"military grade protection\" meant actual physical protection of the screen and lenses, similar to waterproof phone cases.  Not so, it appears. The raised lips are deemed sufficient protection for the the glass surfaces. While this runs contrary to my experience, having ruined both encased iPhone and iPad screens in the past, I embrace this public interpretation and give 4 stars.  I reserve the fifth star based upon my actual on-the-ground (sic) experiences, and will eat my apparent mistake. Fair enough?"
            },
            {
                "review_title": "5.0 out of 5 stars\nAMAZING for drops , but yellows",
                "reviewer_name": "K1P2C3",
                "review_date": "Reviewed in the United States on September 14, 2024",
                "review_text": "This case is absolutely amazing at protecting your phone from drops. I used this on my IPhone 15 pro for a full year with dozens and dozens of drops from all different heights, no screen protector , and no cracks. It definitely yellows as most clear cases do, but for the decent price and the protection it provides it is so worth it. Just ordered again for the IPhone 16 pro as pictured on the left in the photos and on the right is the IPhone 15 pro case used for one year since sept. 2023"
            },
            {
                "review_title": "5.0 out of 5 stars\nFeels comfortable, love the color",
                "reviewer_name": "MJ",
                "review_date": "Reviewed in the United States on October 1, 2024",
                "review_text": "The case feels smooth but has enough traction so it doesn’t feel like it will slip out of your hands at any moment. I appreciate the matte blue color and how there’s protection for the camera lenses."
            },
            {
                "review_title": "5.0 out of 5 stars\nGreat case",
                "reviewer_name": "Maydee43",
                "review_date": "Reviewed in the United States on September 21, 2024",
                "review_text": "Fits the new iPhone 16 Pro Max perfectly. There's a little extra protection around the rear camera lens too. Phone stays put on the car vent holder. Purchased the clear to showcase the white phone.  Hoping it won't yellow"
            },
            {
                "review_title": "5.0 out of 5 stars\nExtremely strong magnet",
                "reviewer_name": "Scott",
                "review_date": "Reviewed in the United States on September 9, 2024",
                "review_text": "I was replacing this with a leather MagSafe case, I wanted the titanium color to be able to show through. I have purchased previous ESR products in the past and their customer service is exceptional. So they were my first choice when looking for a new case. I was not expecting such a strong magnetic attraction. When I want to remove it, I actually pulled the whole mag safe stand right off the table. Great quality. This is not going to fall off any MagSafe adapter or charger"
            },
            {
                "review_title": "5.0 out of 5 stars\nBetter than Otterbox",
                "reviewer_name": "AsiaSF",
                "review_date": "Reviewed in the United States on October 9, 2024",
                "review_text": "This case is thin so easier to hold, material feels better than my expensive Otterbox that yellowed and peeled right away & even eventually got sticky. Haven’t dropped so don’t know how good it is for drops."
            },
            {
                "review_title": "5.0 out of 5 stars\nVery satisfied with my purchase!!!",
                "reviewer_name": "Morningstar",
                "review_date": "Reviewed in the United States on September 20, 2024",
                "review_text": "I recently purchased the clear and black case for my new iPhone 15 Pro Max and I couldn't be happier with my choice. The case looks stunning on my black phone, highlighting its sleek design. The material feels pleasantly smooth to the touch and, most importantly, I haven't experienced any skin reactions like I did with my previous case. It's also incredibly easy to put on and take off, which is a huge plus. Overall, I'm very satisfied with this purchase and highly recommend it!"
            },
            {
                "review_title": "5.0 out of 5 stars\nGreat Case",
                "reviewer_name": "Wazir",
                "review_date": "Reviewed in the United States on September 19, 2024",
                "review_text": "This is the second time I’m purchasing this case, and it’s only because my first one started getting dirty from use. This case held its integrity and reputation as advertised. My phone has fell quite a few times and my phone was undamaged. Very sleek and slim design, yet it provided a great deal of protection for your phone. Highly recommended."
            },
            {
                "review_title": "5.0 out of 5 stars\nOverall good case",
                "reviewer_name": "evancycles",
                "review_date": "Reviewed in the United States on October 12, 2024",
                "review_text": "Case fits well and feels like it will easily protect the iPhone from accidental drops from maybe 3-4 feet.  Case is soft and not slippery either. So far, no complaints. I will be very happy with this case last about a year and a half."
            },
            {
                "review_title": "5.0 out of 5 stars\nDoes as Advertised!!!!",
                "reviewer_name": "Jamie Hathorn",
                "review_date": "Reviewed in the United States on October 7, 2024",
                "review_text": "Love, Love this case. It is clear, adds not girth to the Iphone 15 Pro Max its on and to this day has not shown any yellowing.I have dropped from a height of 5ft or so on many occasions and my phone has come away unscathed.  On a few occasions I have dropped it in between or below my seat in the car and again no damage to screen or case.  Happy enough with this case, that I have not bought another yet. Its snug and all the buttons are cut correctly so as to function as they should.  There is even a bubble around the camera island in the back so as to not scratch the lenses if you set it down. The front screen is protected as well around the edges with the same sort of bubble.This is one of the few cases I have owned in recent memory that I do not have to take off very often to clean all the junk and dust that creeps in from the top or the charging port hole.Definitely recommend this case."
            },
            {
                "review_title": "5.0 out of 5 stars\nBest case for the price",
                "reviewer_name": "Playerpay",
                "review_date": "Reviewed in the United States on October 10, 2024",
                "review_text": "I purchased this after I purchased the new iPhone recently. I know people say if you spend over 1000 on an iPhone why would you risk it with a cheap phone case. Well I can tell those people now technically has came along way and this is literally in my opinion the best bang for your buck case you can buy. It’s made of great quality and I have no doubt this case will protect my iPhone from falls. Before you purchase that 50+ dollar phone case. Go ahead and order one of these and give it a try for a week. If you don’t like it return it. But, I have a feeling you’ll keep it just like me. It is also very easy to remove and reinstall making it easy to clean your phone of dust and debris often."
            },
            {
                "review_title": "5.0 out of 5 stars\nGreat value for money! Allows for MagSafe charging Protects the phone and Camera!",
                "reviewer_name": "Amazon Customer",
                "review_date": "Reviewed in the United States on October 25, 2024",
                "review_text": "Have the iPhone 14 Pro Max, put this on with a temperate glass privacy screen protector and a camera glass protector.  Have dropped it multiple times (unintentionally of course) and it has kept my phone in perfect condition and prevented the screen protectors or camera glass protectors from getting cracked like my previous phone cases have done.It stays on the phone extremely well and also allows use for the MagSafe charger.  Plus still allows you to see the color of your iPhone, not that I care too much, but for many this is a major selling point of buying a particular iphone.Would highly recommend."
            },
            {
                "review_title": "4.0 out of 5 stars\nToo Thick on the Lens Area",
                "reviewer_name": "dlimbizkit",
                "review_date": "Reviewed in the United States on October 12, 2024",
                "review_text": "I needed a phone case right away after getting the iPhone 16 Pro Max. After installing the case, I dropped it several times, and it protected my phone very well. However, the issue with this case is that it is too thick around the lens area, which prevents my wireless charger in the Model Y from registering contact with the phone, causing it not to charge. I tested the phone without the case, and it charges without any issues on the Model Y.I might just get a case without the added protection near the lens and use a separate lens protector instead.Update 10/16/2024: For Tesla users, you can place your phone upside down (with the camera lens at the bottom) to charge it. Although it’s a bit inconvenient, this is the only way to charge your phone wirelessly in Tesla vehicles while keeping the case on. However, I recommend using the usb c port to charge anyway since that is faster."
            },
            {
                "review_title": "5.0 out of 5 stars\nTransparent",
                "reviewer_name": "Gogie",
                "review_date": "Reviewed in the United States on October 25, 2024",
                "review_text": "Fits perfectly and transparent to see the actual iPhone color.. The magnetic plate holds tightly to the contact charger. The touch is not slippery but smooth. The only trouble I had was to activate the camera/video button. The slot for the button is narrow and when I used it for the first time I had a different time activating the camera but in time I quickly learned how to use it without any problem and now I love it. I don’t have to go through all the steps to use the camera like I did with my iPhone 14 Pro Max."
            },
            {
                "review_title": "4.0 out of 5 stars\nAlmost Perfect",
                "reviewer_name": "Quubs",
                "review_date": "Reviewed in the United States on October 3, 2024",
                "review_text": "I’ve had the ESR case since the release of the iPhone 16. I originally wanted the Apple version of this case but didn’t want to pay the Apple surcharge for a case that may not last long. I’d heard about the ESR brand before and thought that this would be the perfect time to try them out.So far, I have not been disappointed by the case. The quality feels sturdy and within my time using it, it has not started discoloring (yet). I have dropped my phone a few times already (inside) and my phone has survived each fall with no blemishes on the case nor phone.My only displeasure from the case comes from the implementation of the camera control. ESR chose to ‘cutout’ method versus the capacitive button that Apple and other brands use. The cutout does not prohibit any functionality in my uses but it does slow the capture flow at times (due to finger hitting the case when using the camera control for swiping)"
            },
            {
                "review_title": "5.0 out of 5 stars\nperfect!",
                "reviewer_name": "lopez fan",
                "review_date": "Reviewed in the United States on October 14, 2024",
                "review_text": "raised lip provides good coverage for the front screen. this is important to me because i have a glass screen protector and a lot of cases dont have edges raised enough to cover the protector.camera protection is also good, but i do wish it had cutout lens holes so that more of the camera glass area is covered.cutouts are precise and has great grip.the lightweightness of the case makes it super convenient on an already heavy phone.10/10 i will always repurchase this as my go-to clear case!im sure it will yellow and get discoloration at some point.magsafe is 10/10"
            },
            {
                "review_title": "4.0 out of 5 stars\nGreat fit and protection appears to be legit…",
                "reviewer_name": "CajunDragon",
                "review_date": "Reviewed in the United States on September 26, 2024",
                "review_text": "I like the look of this on my midnight-colored phone and as you can see, all cutouts line up. It feels sturdy and although it has a slight slick feel, it has held up against slipping so far. I honestly feel it could have some texture or wave or anything to provide added grip, but until it actually slips, I’ll judge on what I experience. It’s definitely better than my iPhone 13PMs Otterbox (sorry Otterbox, you failed me), but as time moves on I’ll update if any issues arise. It does not interfere with the Ailun protector I installed, so far the synergy between the two are agreeable. If only it has better grip.Magnetic abilities are above expected. Not bad at all. I approve.Update: Oct 2024–A few new cables I have purchased do not fit with this case. I think I’m going to keep it as a backup and look elsewhere. Note: This is a great case, I just need something that works with all of my cables, not most of them."
            },
            {
                "review_title": "5.0 out of 5 stars\nThis is a very high quality case!",
                "reviewer_name": "Rufla",
                "review_date": "Reviewed in the United States on October 14, 2024",
                "review_text": "Ever since I bought my IPhone 14 Pro Max, I have been adamant about having no scratches on the screen.  As a result I bought a cover that covered the screen and held credit cards.  Taking pictures was extremely difficult as was paying by ApplePay.Thus, I embarked on a search for a simple solution that was elegant and functional. I came across this amazing case that enhances the beauty, and of my IPhone!  This is the best case I have ever purchased and I have had multiple IPhones since its introduction in 2007.  I highly recommend this case. No negatives too quality excellent value!"
            },
            {
                "review_title": "5.0 out of 5 stars\nMaterial is really soft!",
                "reviewer_name": "Janay",
                "review_date": "Reviewed in the United States on October 3, 2024",
                "review_text": "Item: black, 15 pro max. I had thought the camera protector would come as a separate piece apart from the actual phone case but I didn't read the description either haha. I've also never had a case like this one but it did not disappoint. I ordered this case for my younger brother because he's getting a new phone and he is super clumsy. it's exactly what he needs honestly, it covered the entire phone besides the camera lens, of course, and it is super soft and thick enough to withstand drops. Also, the interior has a soft kind of fur..? So that's perfect to keep it cleaner and avoid any hard scratches on the glass too! I was very satisfied and I'm considering buying myself one of these as well!"
            },
            {
                "review_title": "5.0 out of 5 stars\nPerfect fit, excellent magnet!",
                "reviewer_name": "Andrea H.",
                "review_date": "Reviewed in the United States on October 24, 2024",
                "review_text": "I love the feel of a good silicone case, and this is absolutely perfect. Most silicone cases are thick and they don't include a magnet that's strong enough to reliably hold the iPhone onto a MagSafe charger that's suspended. This one is wonderful! The magnet is so strong I actually have to hold the Charger down to get the phone off of it. That means that, late at night, if it gets bumped, my phone does not fall off the charger. Perfect! Thank you!"
            },
            {
                "review_title": "5.0 out of 5 stars\nAwesome slim silhouette, great grippy feel in hands",
                "reviewer_name": "Dimitri",
                "review_date": "Reviewed in the United States on October 8, 2024",
                "review_text": "Definitely feels great in the hands. The silicone cases are great. The clear ones lack the same great, grippy feel. The slim profile/silhouette is among the best of slim cases I've tried. There are slimmer cases, but you usually compromise on protection with those. This seems like it would be good with your usual day to day drops. The cut out for the camera control button feels pretty seamless. The extra cover for the cameras was a decent selling point for me too, as someone who has had that area crack from drops before. Hoping it lives up to the billing for drop protection, if so this case is as close to perfect as I've tried."
            },
            {
                "review_title": "4.0 out of 5 stars\nGreat Quality",
                "reviewer_name": "Steven Mercado",
                "review_date": "Reviewed in the United States on October 23, 2024",
                "review_text": "It’s a great case, it covers the phone very well while not being too thick.Material feel nice on the hands, but tends to become a bit slippery when hands are sweaty or wet.The MagSafe is very strong which helps with all your accessories.My only complaint is the Camera Action area. Although it’s cut to precision, the added thickness makes it a bit awkward to get in there and work with. The button itself is already finicky as it but overall the case works as intended , will definitely consider other colors in their lineup."
            },
            {
                "review_title": "5.0 out of 5 stars\nAmazing case!",
                "reviewer_name": "Baily Ryan",
                "review_date": "Reviewed in the United States on October 24, 2024",
                "review_text": "I had my iPhone 12 Pro since they came out and recently traded it in. I had it for about 4 years and dozens of cases, this was easily my favorite case I ever had, the magnets were strong and the fit was perfect, I never noticed any yellowing when I traded my phone I actually gave the case to my sister for use on her iPhone 12 and she loves it as well!"
            },
            {
                "review_title": "5.0 out of 5 stars\nMuch cheaper than the clear Apple case, but actually better!",
                "reviewer_name": "Mark A. Sikes",
                "review_date": "Reviewed in the United States on October 9, 2024",
                "review_text": "I got the Apple case for my iPhone 12 Pro Max, and while it was \"ok\", it was kind of pricey, not that grippy and over time got a few cracks etc...but it did its job protecting the phone.  I just got this case for the iPhone 16 Pro Max and immediately found it more grippy, way cheaper, and seems to have better corner protection.  Works great with MagSafe charging, too.  Hopefully it'll last as well or better than the Apple case, but even if not it seems to be a win."
            },
            {
                "review_title": "4.0 out of 5 stars\nColor not as pictured, otherwise I love it",
                "reviewer_name": "XWing",
                "review_date": "Reviewed in the United States on September 21, 2024",
                "review_text": "As far as the functionality, this case works very well with my iPhone 16. The cutouts are right where they should be, and the case looks like it will protect the phone well if I drop it. There are extra raised bumpers on the corners. I combined it with the ESR glass screen protector, so I should be well covered. The magnet is GREAT, especially because I have an ESR HaloLock charging stand; it locks on rock solid.I got the teal (green) phone, so I wanted a green case that was somewhat of a match. The color of the actual case is not nearly as bright as shown in the photos. It's definitely a dark olive color. I'd probably love it if I worked for the U.S. Army, but since I don't, it was a disappointment. I'm still keeping it, though, because everything else about it is perfect."
            },
            {
                "review_title": "5.0 out of 5 stars\nBetter than original form Apple store",
                "reviewer_name": "Michelle B.",
                "review_date": "Reviewed in the United States on October 11, 2024",
                "review_text": "Got 2 for family. Love this case for iphone 13 Pro Max.  Very similar to the ones we got at Apple store with our phones, but better in 2 ways.  Side buttons much easier to press, and magnet is stronger. I found it not quite so slippery which is good when in hands, but not so much at first as I found it a bit more difficult to slide into my belt case that has little wiggle room; but that seems to be improving over time.  I'd buy again."
            },
            {
                "review_title": "5.0 out of 5 stars\nAttractive mag lock case",
                "reviewer_name": "XDiabeticX",
                "review_date": "Reviewed in the United States on October 23, 2024",
                "review_text": "Great mag lock which snaps into place easily and snugly on the phone. I have no way to know if it will yellow over time as many clear cases do, but I assume it will eventually. But it’s a great price point even if it eventually needed to be replaced. It’s quite functional and the magnets are really useful for putting the phone on a charger stand."
            },
            {
                "review_title": "4.0 out of 5 stars\nA Solid All-In-One Protection Package with Minor Drawbacks",
                "reviewer_name": "Christopher Wells",
                "review_date": "Reviewed in the United States on July 25, 2024",
                "review_text": "I recently purchased this clear phone case with a tempered glass screen protector, lens protectors, and MagSafe compatibility, and overall, for my wife and we are quite pleased with it. Here’s a breakdown of what we've experienced so far:Pros:Comprehensive Protection: The inclusion of a tempered glass screen protector and lens protectors alongside the clear case is a huge plus. It feels reassuring to have a complete set of protection for my phone. The screen protector is particularly impressive; it's clear, responsive, and doesn't affect the touch sensitivity of my screen.MagSafe Compatibility: The built-in MagSafe ring works seamlessly with my MagSafe charger and accessories. The alignment is spot-on, and charging is both efficient and secure. This feature was a key selling point for me, and it definitely lives up to the hype.Clear and Sleek Design: The case itself is crystal clear and showcases the design of my phone without adding much bulk. The clarity of the case has not diminished over time, and it resists yellowing, which is always a concern with clear cases.Cons:Edge Protection: While the case provides decent coverage, the edges feel a bit more exposed compared to other cases I’ve used. It’s not a deal-breaker, but I’d prefer slightly more cushion around the corners for added peace of mind against drops.Lens Protectors Fit: The lens protectors are a good idea, but they can be a bit tricky to apply perfectly. I found myself spending a little extra time ensuring they were aligned correctly. Once in place, they do their job well, but a better application guide or pre-aligned design could improve this aspect.Overall: This package offers excellent value with its all-in-one approach to phone protection and MagSafe compatibility. The minor issues with edge protection and lens protector application are outweighed by the benefits of having a clear, functional, and stylish case. I’d definitely recommend it for anyone looking to keep their phone safe while enjoying the benefits of MagSafe technology."
            },
            {
                "review_title": "4.0 out of 5 stars\nSolid but very slick",
                "reviewer_name": "UrsaMajor",
                "review_date": "Reviewed in the United States on October 22, 2024",
                "review_text": "The case feels like it will be good protection.. I like the extra padding on the corners. Two issues -While the sides of the case are “grippy” the back is clear and very slick.  I’m going to try it for a while but I’m not really loving the feel. I think it could easily slip out of my hand. Secondly,  the buttons on the left look like they will easily tear out.So good case but has some issues."
            },
            {
                "review_title": "5.0 out of 5 stars\nGreat phone case and better than tried and true brands",
                "reviewer_name": "Nick",
                "review_date": "Reviewed in the United States on October 4, 2024",
                "review_text": "I got two Spigen cases for my new iPhone and they were both disappointing especially since the mag safe compatible one didn’t charge my phone.This phone case was already better before it arrived, the seller reached out before which was nice since this is a very new product. It already feels better than any apple, spigen or otter box case I’ve ever owned. The MagSafe works great and overall I’m pleased with the case. I’ll update with how the case wears and ages but so far so good!"
            },
            {
                "review_title": "4.0 out of 5 stars\nItem defective",
                "reviewer_name": "aduckfan",
                "review_date": "Reviewed in the United States on September 20, 2024",
                "review_text": "I opened the box plugged it in with the supplied cable and charger and nothing, no charge or activity light indicators showing. I emailed the supplier explaining to them the situation. I gave them a couple days to respond and so far I've haven't heard anything back so I returned the item.I did however like the look and feel of this charger so I'm exchanging the defective unit with the same product. I will reevaluate my review when I receive new charger.Received replacement and I’m very pleased. I have several different chargers like this one and this one is the best of all of them. I didn’t rate them with a five because of their lack of response to my email which concerned me if I had issues after amazons 30 days"
            },
            {
                "review_title": "5.0 out of 5 stars\nAs Expected",
                "reviewer_name": "Jules",
                "review_date": "Reviewed in the United States on October 18, 2024",
                "review_text": "Case came as expected and fit my iphone 15 pro without issue.  It's slightly not has \"grippy\" as my last case but didn't take much to get used to.  It also seems like it could have a bit of a higher lip around the phone itself.  The mag works without issue.  For the price I think this is a very good value."
            },
            {
                "review_title": "5.0 out of 5 stars\nBought this as a gift, going to buy a couple more",
                "reviewer_name": "Matthew",
                "review_date": "Reviewed in the United States on October 14, 2024",
                "review_text": "As the title says, bought this as a gift, really ony needed something magsafe compatible. The case itself is really nice, not flimsly at all but not at all bulky, the interior is lined with a micro suede and feels really nice. The camera protection is also always a concern and this case has very generous accommodations for the camera bulge.The quality is so outstanding, i'm actually ordering more for everyone in my family that uses an iphone, definitely recommend."
            },
            {
                "review_title": "5.0 out of 5 stars\nsaved it from falling off my truck when I drove off.",
                "reviewer_name": "Amber L",
                "review_date": "Reviewed in the United States on September 27, 2024",
                "review_text": "I love the green color and I love the feel of the case. Came in with no issues no mishaps and it fits the phone perfectly.I literally left it on the edge of the hood of my truck and drove half a mile with multiple turns and I found out someone turned my phone in the front of the grocery store saying it was on my hood. I was SHOCKED it stayed but so thankful because my last phone I did that, it got ran over and really messed my phone up. Least to say ima stop putting my phone on my truck but I’m thankful for this case!!"
            },
            {
                "review_title": "4.0 out of 5 stars\nGreat case",
                "reviewer_name": "Shannon K.",
                "review_date": "Reviewed in the United States on August 31, 2024",
                "review_text": "I love the magnetic, it’s the first magnetic case I’ve purchased. I got the clear because my phone is Navy Blue and I wanted to be able to keep the integrity of the color as I always just cover them up and what’s the point of having a phone color?! But I can never find a case that doesn’t still take away from the phone, I’m not sure they can truly be made slim enough to be protective. This didn’t hit the mark for me on that part but it’s not a knock at the case because I’m not sure it’s a realistic request. But keeps me from giving it a 5 star as I wasn’t blown away on that. Just my personal quirky “want”. But this does hold my magnetic pop-socket on with a beyond strong hold and that’s probably the most important. So I can’t quite give a 5 but do wish I could give a 4.5 instead of a 4."
            },
            {
                "review_title": "5.0 out of 5 stars\nHad to match the kiddo",
                "reviewer_name": "PRZN_MiKE",
                "review_date": "Reviewed in the United States on October 21, 2024",
                "review_text": "This company has some good phone cases. And at a good price. Got one for my kiddo n she wanted me to match her. Not a fan of clear because it turns yellow pretty fast but this is still clear! I wonder what kind of sorcery magic they are doing to make it clear"
            },
            {
                "review_title": "4.0 out of 5 stars\nLittle disappointed",
                "reviewer_name": "Lana",
                "review_date": "Reviewed in the United States on September 2, 2024",
                "review_text": "I needed to replace my original case that I bought at Apple Store when I purchased my iPhone. I don’t drop my phone too often but it happens. The first time I dropped my iPhone the screen protector cracked. ( I’ve had the same screen protector since I bought the phone few years back) and now it got few more cracks on the screen protector. So I went back to my old case, even though it’s all beat up but I trust it a lot more than this one. I do like how this one looks and feels. It works great with my magnetic wallet and the wireless charging port at my home and my car. It’s just not as sturdy as I like it to be. I am keeping it and will use it just not all the time."
            },
            {
                "review_title": "5.0 out of 5 stars\nNew phone - great fitting case",
                "reviewer_name": "Armando",
                "review_date": "Reviewed in the United States on October 17, 2024",
                "review_text": "Just got my new iPhone 16, and wanted to ensure that it was properly protected, but I wanted to enjoy the beauty of the phone itself. This case fit like glove, and it allows for charging on the charge cradle with no problems. Got one of these cases for myself, and one for my wife, both cases fit great!"
            },
            {
                "review_title": "5.0 out of 5 stars\nBetter than Apple’s!",
                "reviewer_name": "Amazon Customer",
                "review_date": "Reviewed in the United States on October 18, 2024",
                "review_text": "I had an iPhone 14 and bought the Apple clear case. It was slippery and really hard to remove.  I chose this  one for my new iPhone 16. I like it better since it’s imore tactile so it doesn’t feel like I might drop the phone. It’s also more flexible making it easier to remove."
            },
            {
                "review_title": "5.0 out of 5 stars\nGreat phone case",
                "reviewer_name": "travis gulotta",
                "review_date": "Reviewed in the United States on October 15, 2024",
                "review_text": "This phone case is pretty durable. I like the clear case never have one before and I’m liking it a lot instead of hiding my phone undercover. I can at least see it now. Has a rubber filled to it and I’ve dropped it a couple times and it survived"
            },
            {
                "review_title": "5.0 out of 5 stars\nExactly what I wanted",
                "reviewer_name": "Jesus Olguin Jr.",
                "review_date": "Reviewed in the United States on October 10, 2024",
                "review_text": "Good discount for basically a new iPhone 15 pro max. 100% battery health, with only one battery charge cycle. It works and looks beautifully. It had one scratch on the screen but I’ll take that. Apple doesn’t sell the iPhone 15 pro anymore so this was an easy choice. Better than the 16 pro, in my humble opinion."
            },
            {
                "review_title": "5.0 out of 5 stars\nNice, simple case",
                "reviewer_name": "Deneen",
                "review_date": "Reviewed in the United States on October 3, 2024",
                "review_text": "I had to get a new phone after an accident and I didn’t think to order a case at the same time as the phone. I got this one, even though I feel like everyone alive has this same case. It looks and feels nice, fits the phone perfectly. It’s easy to get the phone in and out without feeling like the case is slipping off or superglued in. The color is clear so I can see the nice color of my phone. Fingers crossed it’ll actually stand up to drops, etc."
            },
            {
                "review_title": "5.0 out of 5 stars\nServes the purpose",
                "reviewer_name": "T Teo",
                "review_date": "Reviewed in the United States on October 16, 2024",
                "review_text": "The color is nice and protects the phone as it should. I bought a different brand and from a gentle drop, the screen protector broke. I returned that one and bought ESR MagSafe. So far so good. The blue color goes well with the ultra marine color of the Iphone16 Plus."
            },
            {
                "review_title": "4.0 out of 5 stars\nButtons are a bit hard to push",
                "reviewer_name": "Joper",
                "review_date": "Reviewed in the United States on September 30, 2024",
                "review_text": "The ESR for iPhone 15 Pro Case with MagSafe perfectly fits my iPhone 15 Pro and has a strong magnet. The exterior texture of the case is smooth and somewhat grippy. Dark blue is a very nice color IMO. The hole cutouts for the camera lenses, bottom speaker, and USB-C connection are perfectly aligned. The case has a felt-like material on the inside which is nice but my only complaint would be that the buttons are somewhat hard to push compared to other cases I've owned."
            },
            {
                "review_title": "5.0 out of 5 stars\nFinally, a black/clear case with a BLACK magsafe ring",
                "reviewer_name": "OJ",
                "review_date": "Reviewed in the United States on September 3, 2024",
                "review_text": "I have a black iPhone 15 pro and wanted a simple black/clear case for it. It was surprisingly tough to find one that didn’t have a bright white visible Magsafe ring on it, but finally I stumbled upon this case - the edges are black, the backing is clear, and the Magsafe ring is also black.It fits the Pro well with my glass screen protector on it. The lip around the camera should protect the lenses if face down, and the lip comes up a little bit above the screen protector as well. There are cutouts for the buttons - I kind of prefer cases that cover the buttons so dust doesn’t build up in them. But for $12 I’m willing to try it out.I’m hoping it doesn’t yellow over time but will update if it does.So far, a nice basic black/clear case."
            },
            {
                "review_title": "5.0 out of 5 stars\nPleasantly Shocked",
                "reviewer_name": "Karin Janiszewski",
                "review_date": "Reviewed in the United States on September 14, 2024",
                "review_text": "I give this iPhone 14 (light blue) a 10/10.The body of the phone is flawless and without scratches. The phone fired up immediately and I was easily able to transfer data from my old iPhone 14 Pro Max (that was crushed in an unfortunate coffee mug accident) to this one. This is the first time I have purchased a used phone, and I will never buy new again. Prior to purchasing, I researched to find the best deal for the 14 model. No one could beat this price and my concern then was quality. The quality is excellent.I really am very pleasantly surprised and satisfied."
            },
            {
                "review_title": "5.0 out of 5 stars\nIt’s perfect!",
                "reviewer_name": "Jessica T.",
                "review_date": "Reviewed in the United States on October 25, 2024",
                "review_text": "This phone case is just perfect! It fits great and I love the slight shimmer. I’ve already dropped my phone a few times🤦🏻‍♀️ and it’s protected my phone. Great phone case for the price! I’ll definitely be buying from them again when I need a new case. 🙂"
            },
            {
                "review_title": "5.0 out of 5 stars\nCLEARly great!",
                "reviewer_name": "Jane Ann",
                "review_date": "Reviewed in the United States on September 28, 2024",
                "review_text": "I wanted a clear case so I can enjoy my new red iPhone and this one is perfect!  Installation was simple and it provides 100% coverage.  I particularly like that the case has extended tabs for the phone side buttons, meaning that my arthritic, sore fingers can easily use these buttons for screenshots, volume control, and powering on and off.  I love it and believe you will, too!"
            },
            {
                "review_title": "5.0 out of 5 stars\n6 month update - Get this case!",
                "reviewer_name": "Kiana Jasmyne",
                "review_date": "Reviewed in the United States on September 11, 2024",
                "review_text": "I waited until I had some time to test the durability of this case, and this one has definitely exceeded my expectations. The main feature I was searching for in a case was something that covered the camera area - check. Also, I’m a klutz with my phone and drop it all the time, it gets tossed around (kids) and despite sticky fingers and being put in situations where it could easily get scratched - this case has held up AMAZING. It’s soft to the touch that doesn’t allow many markings, yet still so protective. I’m also an artist and have used my phone while painting, from smaller projects to heavy duty paints and spray paints on murals…both wet and dry paint did not stick or stain - on a beige/cream color case!! I will absolutely be ordering again in other colors!"
            },
            {
                "review_title": "5.0 out of 5 stars\nPerfect Fit Reasonable Price",
                "reviewer_name": "BAmaz",
                "review_date": "Reviewed in the United States on September 28, 2024",
                "review_text": "The case fit the phone perfectly.  It appears to provide good protection with a raised area around the display and camera bump and raised areas at the corners.  It doesn't have the sapphire camera button but none of the lower cost cases do yet.  The cutout for the camera button seems to work fine.  The cutouts at the bottom of the case align correctly and the buttons all work correctly.  The manufacturer reached out after purchase to make sure everything was good."
            },
            {
                "review_title": "4.0 out of 5 stars\nGood looking case, but gets stuck in pocket",
                "reviewer_name": "jaswan",
                "review_date": "Reviewed in the United States on October 15, 2024",
                "review_text": "This case looks great, easy to put on the phone, but if you are carrying it in your pocket just be aware the texture of the case makes it difficult to take in and out of your pocket. Several times a day I would turn my pocket inside out getting my phone so I ended up buying a new case."
            },
            {
                "review_title": "5.0 out of 5 stars\nGreat affordable case",
                "reviewer_name": "Eric Goodman",
                "review_date": "Reviewed in the United States on September 24, 2024",
                "review_text": "Minimalistic case that will protect your phone from most common drops. Comfortable to hold in your hand and doesn't add any extra bulk to your phone when sticking it in your pocket. Magnetic back makes it really easy to wirelessly charge (I used to move my phone around until it got a connection...now it's pretty instant)."
            },
            {
                "review_title": "5.0 out of 5 stars\nI was a bit skeptical …",
                "reviewer_name": "Jessica",
                "review_date": "Reviewed in the United States on September 29, 2024",
                "review_text": "I was hesitant to purchase this product but I had just purchased a new phone and always had my phones plugged n a case of some sort. But after I purchased this case I found myself dropping my new phone more often, the case is quite slim, but to my surprise it was well protected even though the case doesn’t seem to be bulky. So far nice product going strong!"
            },
            {
                "review_title": "5.0 out of 5 stars\n#1",
                "reviewer_name": "TL",
                "review_date": "Reviewed in the United States on October 17, 2024",
                "review_text": "After trying Apple Clear case, DBrand Grip, DBrand Ghost, I ended up trying this. A 100k+ having a positive experience is something in itself. The case simply outperforms other cases twice or even thrice as expensive. Wish I’d gotten to this sooner. Absolute win ESR."
            },
            {
                "review_title": "4.0 out of 5 stars\nEs super resistente y se siente muy bien al tacto",
                "reviewer_name": "William I. Hernandez Rios",
                "review_date": "Reviewed in the United States on September 14, 2024",
                "review_text": "​El ESR Krystec Clear Case es definitivamente una excelente opción.​ Es super resistente y se siente muy bien al tacto, lo que me da confianza en su capacidad de proteger mi iPhone 14 Pro Max. Cuando es nuevo, se ve brutal de lindo, casi como si no tuviera un case en absoluto.Sin embargo, debo mencionar que tiene un pequeño inconveniente: es un imán para los rayazos. Aunque no se pone amarillo con el tiempo como otros covers transparentes, me gustaría que fuera un poco más resistente a las marcas de uso diario.Le doy un 4/5. En general, es un gran case que combina estilo y funcionalidad, pero si te preocupan los rayones, quizás debas tenerlo en cuenta. ¡Aun así, lo recomendaría!"
            },
            {
                "review_title": "5.0 out of 5 stars\nESR Case Is AMAZING!!",
                "reviewer_name": "Nero",
                "review_date": "Reviewed in the United States on October 16, 2024",
                "review_text": "Tough, Durable, Rugged… for a thinner case, this thing is a BEAST!! My phone fits like a glove! No gapping or warping, very smooth and easy to handle and hold. I don’t think cases come much more secure than this!! Highly Recommended! A+ job, ESR!!"
            },
            {
                "review_title": "4.0 out of 5 stars\nYellowed in about 5 months (updated)",
                "reviewer_name": "mixmaven",
                "review_date": "Reviewed in the United States on September 5, 2024",
                "review_text": "Edit: ESR reached out after reading my review and apologized for my issue, they offered to replace or refund my purchase. I've never had issues with ESR customer serviceI love ESR and always buy their products, but unfortunately, this case has yellowed.It might be hard to tell from the pictures, but the bottom is an Apple case that is 1.5 years old, the top is a 5 month old ESR case that has already started to slightly yellow.  I keep my cases clean, wipe them down with alcohol, clorox wipes, weekly. Sadly, I wouldn't recommend."
            },
            {
                "review_title": "5.0 out of 5 stars\nHandle With Care",
                "reviewer_name": "Phill.The.Thrill",
                "review_date": "Reviewed in the United States on October 12, 2024",
                "review_text": "I always thought it was kinda foolish to worry about the color of my iPhone when I’d buy a case that covered it up. When my old case started tearing apart, I opted for this see through case that has been working great and is far less expensive than my old one. It’s thick enough to give you more to hold onto so I’d say it gives you more to love."
            },
            {
                "review_title": "5.0 out of 5 stars\nExceeded Expectations: Sleek Design and Top-Notch Quality!",
                "reviewer_name": "Eric Soler",
                "review_date": "Reviewed in the United States on September 16, 2024",
                "review_text": "As someone who typically approaches unfamiliar brands with a bit of skepticism, I wasn't sure what to expect from ESR. However, after reading the glowing reviews, I decided to take a chance—and I'm glad I did. From the moment I unboxed it, the quality of this product was evident. The craftsmanship is top-notch, and the materials feel premium, not at all like some of the other options in this price range. What really won me over, though, is the subtle yet sophisticated design. It's sleek without being flashy, blending perfectly with my style and keeping a clean, streamlined aesthetic. ESR has truly impressed me, and I wouldn’t hesitate to recommend it to anyone looking for both functionality and style in one package."
            },
            {
                "review_title": "5.0 out of 5 stars\nGreat Case, even better with Mob Armor flex magnetic charger",
                "reviewer_name": "Albert C.",
                "review_date": "Reviewed in the United States on September 24, 2024",
                "review_text": "I got this case for my new iPhone 15 and I was worried that it wouldn’t match up with my existing mob armor flex magnetic wireless charger that is mounted in my work truck. It slaps right on there, solidly attached, and I drive on some hellacious roads that most mounts would drop the phone. The wireless charging works awesome and the case is slim and not bulky."
            },
            {
                "review_title": "4.0 out of 5 stars\nGreat Looks, Minimal Protection",
                "reviewer_name": "R. Johnson",
                "review_date": "Reviewed in the United States on July 22, 2024",
                "review_text": "If you're looking for a slim and lightweight MagSafe case for your iPhone 15 Pro, The ESR clear/black option should make you happy. This case looks great and fits  my 15 Pro very well.The black edges have a nice smooth feel, but I wish they were a little more \"grippy.\" The built-in MagSafe magnets provide  wireless charging compatibility, while the clear back shows off the titanium finish of your iPhone Pro.I am a little concerned with the case's protective qualities. The slim appearance comes at the cost of less protection around the most critical areas. The raised lip around the screen could be more robust, and I'd like to see more cushion around the frame, but I guess that's to be expected at this price-point. The edge around the lenses seems to work very well.If you're serious about better drop protection, you should look at dual-layer or more rugged options instead. For me, this seems good enough for my day-to-day usage. I have a bulkier case if I'm heading out on an adventure. It will be interesting to see how this case holds up over time."
            },
            {
                "review_title": "5.0 out of 5 stars\nAmazing customer service and product",
                "reviewer_name": "Scott Uhler",
                "review_date": "Reviewed in the United States on October 14, 2024",
                "review_text": "I had originally ordered the wrong size case, but after just a couple emails, ESR sent out the correct case without hesitation.  The case itself is very well made and is exactly what I was looking for in terms of styling and quality."
            },
            {
                "review_title": "5.0 out of 5 stars\nLooks Great, Works Great",
                "reviewer_name": "G. W., Florida",
                "review_date": "Reviewed in the United States on October 1, 2024",
                "review_text": "Looks great and works great, or at least it does so far. I have tested the ability of the case to save the phone from any clumsiness, but I have confidence that it will be more than capable of doing the job."
            },
            {
                "review_title": "5.0 out of 5 stars\nGreat iPhone case",
                "reviewer_name": "L. Mitchell",
                "review_date": "Reviewed in the United States on October 3, 2024",
                "review_text": "The case I purchase in store was too slick and I wanted to replace it asap.  This has nice grip along the edges but isn’t too rough or rubbery. The fact it works with the MagSafe products makes it even better!"
            },
            {
                "review_title": "4.0 out of 5 stars\nQuestionable for non Magsafe wireless charging",
                "reviewer_name": "Ray",
                "review_date": "Reviewed in the United States on August 28, 2024",
                "review_text": "I have no complaints about the case itself or the fit but a warning to anyone using non-Magsafe chargers. I have a wireless charger in my car and one on my alarm clock. Neither charge very well through this case. If I get the phone spot on on the clock, it will charge, although it will stop and start once in a while. The car is nearly impossible to get it to charge because whenever it slides just a little bit it stops charging. If you have Magsafe chargers, probably not a problem, but since mine are built into things, I just pull the case off when I need to charge."
            },
            {
                "review_title": "5.0 out of 5 stars\nVery pleased",
                "reviewer_name": "Dwetterm",
                "review_date": "Reviewed in the United States on October 5, 2024",
                "review_text": "I’m very happy with my purchase. I was hesitant at first because of some reviews claiming  the case yellowed or did not fit well. Yellowing and how to avoid it clearly explained in the package plus it comes with a 12 month warranty if it does. Perfect fit nice and snug. All buttons and magnetic charger works as they should. I consider it a good buy."
            },
            {
                "review_title": "4.0 out of 5 stars\nSturdy Case for a good price",
                "reviewer_name": "M Bonnett",
                "review_date": "Reviewed in the United States on September 24, 2024",
                "review_text": "This is the 2nd case we have purchased from this company. It is a solid choice and works well. The level of protection seems on par with more expensive options. The only downside is that the clear case tends to get dirty easily and within 6 months has a brown tint even after being cleaned. If you're looking for a clear case that shows off the color of your iPhone - this is a good option."
            },
            {
                "review_title": "5.0 out of 5 stars\nDoesn’t Yello-Discolor",
                "reviewer_name": "George Sevick",
                "review_date": "Reviewed in the United States on September 23, 2024",
                "review_text": "I have used iPhones for years and with their colors prefer a clear case. While a number of products on Amazon advertise non-yellowing clear cases,  this one actually doesn’t yellow-discolor.  Other cases for my iPhone 15 Pro would discolor after 45 day but this one look s clear and brand new after two months. I’ll only buy this brand for future iPhones."
            },
            {
                "review_title": "5.0 out of 5 stars\nLightweight",
                "reviewer_name": "Efg in Fla",
                "review_date": "Reviewed in the United States on October 18, 2024",
                "review_text": "I needed a Mag Safe case for my iPhone 14 Pro so I could use the new 3 in 1 charger I purchased.  This fir the bill perfectly.  It is lightweight but also gives my phone the protection it needs."
            },
            {
                "review_title": "5.0 out of 5 stars\nAs advertised - ESR PROTECTIVE PHONE CASE",
                "reviewer_name": "I Love Shopping",
                "review_date": "Reviewed in the United States on September 19, 2024",
                "review_text": "Clear color - It looks sci-fi-ish because of the the clear makes the grey back and black metallic sides of my IPhone 13 Pro Max shine bright like a diamond.  Ready for Star Trek!  Would take a picture but can’t since it’s on my phone.  The firm but soft polycarbonate aids in gripping the phone.  Fits my phone and hand nicely.  Will purchase again when this one croaks.  It’s advertised as non-yellowing.  But, if it yellows I’ll 😭 and buy another one😂."
            },
            {
                "review_title": "5.0 out of 5 stars\nBest case I’ve ever had",
                "reviewer_name": "Nicholas A.",
                "review_date": "Reviewed in the United States on October 8, 2024",
                "review_text": "I absolutely love this case not only is the magnet on the back of it super super strong but this is such a nice and light case. I wish I would’ve found this earlier in my iPhone journey definitely five stars."
            },
            {
                "review_title": "5.0 out of 5 stars\nGreat Combo Kit",
                "reviewer_name": "Dane Daughtrey",
                "review_date": "Reviewed in the United States on September 18, 2024",
                "review_text": "All 3 parts of the combo protection kit are holding up great! If the camera covers aren't your thing you can leave them off and the case still offers protection from them receiving any direct contact while laying the phone down.The screen protector feels quality and even the little air bubbles that remained had disappeared after 12 or so hours of being on the phone.I wish the combo had the case in different colors, but that can be an upgrade later.The case itself feels good in the hand and isn't too slick. I use a MagSafe wallet that makes the whole phone very comfortable to hold."
            },
            {
                "review_title": "5.0 out of 5 stars\nGood case",
                "reviewer_name": "Michael Murphy",
                "review_date": "Reviewed in the United States on October 3, 2024",
                "review_text": "Installs easily and provides good protection for the camera lens. Also supports magsafe. For the few months I had it, there was no yellowing of any sorts. Would recommend for those looking for a cheap clear case that protects well."
            },
            {
                "review_title": "5.0 out of 5 stars\nMy first ESR case, very impressed",
                "reviewer_name": "zack eaton",
                "review_date": "Reviewed in the United States on September 28, 2024",
                "review_text": "I bought this clear ESR case as a short term solution with other cases being back ordered etc. I am surprised at how well this case protects my phone. It feels premium, and I would compare it to the original apple cases. The mag safe arguably feels stronger than apple cases. I’m very pleased with my purchase"
            },
            {
                "review_title": "5.0 out of 5 stars\nGreat buy!",
                "reviewer_name": "Erika",
                "review_date": "Reviewed in the United States on October 13, 2024",
                "review_text": "This phone case came just as pictured and easy to put on! They sent me 2 for the price of 1 which was nice! Functions great and fits my iPhone 16 pro max great! I got the frosted clear color and looks just like the picture!"
            },
            {
                "review_title": "5.0 out of 5 stars\nLooks great and protects my phone very well",
                "reviewer_name": "Tino Brrrrrrito",
                "review_date": "Reviewed in the United States on October 20, 2024",
                "review_text": "This phone case is crystal clear and instantly made my phone look like new again when I put it on.  I’ve had this case for a few months and it’s still crystal clear (no yellowing or scratches - see pics)."
            },
            {
                "review_title": "5.0 out of 5 stars\nEasy installation for the iPhone 16",
                "reviewer_name": "Jazzygirl61",
                "review_date": "Reviewed in the United States on October 15, 2024",
                "review_text": "I recently purchased an iPhone 16 and needed a case to protect it. The color was exactly as shown and the price was great. I like the fact that it was easy to use and it’s a soft cover. The additional camera cover was a plus. Instructions were included but you don’t need them. I highly recommend this case from this seller."
            },
            {
                "review_title": "5.0 out of 5 stars\nDurable",
                "reviewer_name": "Jesse Cardoza-Cusiter",
                "review_date": "Reviewed in the United States on October 14, 2024",
                "review_text": "This case is beyond durable. My husband drops his phone all the time while using expensive cases and his screen or camera always breaks. I’ve had this for months and dropped my phone many times and not event a mark, scratch or crack on my phone. Definitely will buy more cases from this company in the future"
            },
            {
                "review_title": "5.0 out of 5 stars\nStylish and Durable MagSafe Case for iPhone 15 ProMax",
                "reviewer_name": "Alfredo Alvarez",
                "review_date": "Reviewed in the United States on September 29, 2024",
                "review_text": "The ESR MagSafe Military-Grade Clear Black Case is a great blend of protection and style for the iPhone 15 ProMax. The clear black design showcases the phone while adding a sleek, modern touch. It offers solid military-grade protection without being bulky, and the raised edges around the camera and screen give extra peace of mind.What’s most impressive is the flawless MagSafe compatibility. The magnets are strong, ensuring a secure connection with chargers and accessories. Overall, it’s a durable, stylish case that enhances both the look and functionality of the iPhone 15 ProMax. Highly recommended for anyone looking for reliable protection that doesn’t compromise on aesthetics."
            },
            {
                "review_title": "5.0 out of 5 stars\nSeven months & very pleased. 3 reviews provided below",
                "reviewer_name": "Capt Jon",
                "review_date": "Reviewed in the United States on February 24, 2024",
                "review_text": "I have an iPhone 14 Pro. Please see all three reviews below:One month review:  Very pleased with my new clear case. Time will tell if it yellows as some have reported, but it appears that those that reported as much were mostly pleased with customer service. I’ll check back in a few months to update.The edge surrounding the camera lenses is higher than the lenses themselves, but only slightly. Ideally I would like a bit more protection, but this is adequate for flat surfaces.After wiping down with a microfiber cloth it does not appear to a fingerprint problem. I wipe it down often, as I have done with all of my phones over the years. The edges are not overly “grippy,” but not slippery and has an overall good feel.The magnetic field is very plenty strong, and the buttons all work well.Six months update:No yellowing and grip seems to have improved. Not experiencing any finger print issues, but an occasional wipe across your t-shirt doesn’t hurt.Thirty minutes ago while looking elsewhere, I tripped over an unexpected top concrete step with phone in hand. I fell hard forward, putting my hands out to break my fall. Unfortunately, I had my phone in my hand and it slapped down hard onto a concrete sidewalk! Fortunately for me it was professionally installed and fairly smooth as concrete goes.  Fearing the worst, I turned my phone over and was shocked to see only three little dings on my tempered glass screen protector, and no apparent damage to the screen itself!I will be sticking with this brand in the future!One month later, seven months:The edges of the case have started to yellow a good amount. I cannot overlook the fact that the timing of this is in line with my installation of a new magnetic charger / mount in my car. Installed in an air vent, it is now a good deal higher than before and exposed to a lot more direct sunlight than before.When I reached out to the manufacturer, I received a prompt response offering to replace the case under the two year warranty, but they did recommend a black case to replace it, after pointing out the various issues that might cause yellowing, especially direct sunlight. Despite this, I opted to replacing it with another clear case. It has served me well and I like the look. The replacement has already been shipped and I am extremely pleased with the prompt response and solution by the customer service team. I don’t know for certain, but I doubt a second replacement would be at no cost. In the meantime I will have to rethink the positioning of my car mount."
            },
            {
                "review_title": "4.0 out of 5 stars\nInitial impression-buttons are hard to press",
                "reviewer_name": "Earth Worm",
                "review_date": "Reviewed in the United States on October 13, 2024",
                "review_text": "I just got the case.Needs improvement:  Feels like it should for a silicone case. A little too slippery but I know he’s gonna get better over time. But the buttons are hard to press. I had a non-silicon ESR case on my phone before and the buttons were much more soft.Positive: The magnet in the back of the phone is as usual fantastic. My ESR MagSafe wallet sticks like it’s glued on."
            },
            {
                "review_title": "5.0 out of 5 stars\nVERY similar to the Otterbox version of the stardust case.",
                "reviewer_name": "Claudia Moore",
                "review_date": "Reviewed in the United States on September 26, 2024",
                "review_text": "I bought this as a temporary case until I found a stardust Otterbox case that was out of stock near me (I’ve had this specific type case for years and needed to get a new one for my upgraded phone). I found the otterbox before this case came in and I paid $59 for the otterbox. My husband and I compared the two and the products are almost identical! I decided that I’m returning the Otterbox! For $13 (what I paid for this case), you can’t beat that price!"
            },
            {
                "review_title": "5.0 out of 5 stars\nVery happy",
                "reviewer_name": "Amazon Customer",
                "review_date": "Reviewed in the United States on October 11, 2024",
                "review_text": "This case is similar to the name brand one I bought for my iPhone - it looks great - hopefully it protects my phone well since I do seem to drop it a lot;) I will update my review if I have any negatives that come up.Overall happy after a week + of use."
            },
            {
                "review_title": "5.0 out of 5 stars\nGreat protection",
                "reviewer_name": "Megan",
                "review_date": "Reviewed in the United States on October 6, 2024",
                "review_text": "This case has kept my phone safe from more drops than I care to admit over the past 11 months. Recently I dropped my phone off of the top row of high school bleachers onto a gym floor, at least 12 feet. I thought my phone was toast. It was fine. This case is awesome."
            },
            {
                "review_title": "5.0 out of 5 stars\nOrdered two and we love it",
                "reviewer_name": "NF403",
                "review_date": "Reviewed in the United States on October 7, 2024",
                "review_text": "I ordered one for myself to replace the one that I got at tjmaxx that I had for almost a decade it seems and I love it. My son saw mine and the one he had was used and abused so we ordered him one too. We both love it and have zero complaints thus far."
            },
            {
                "review_title": "5.0 out of 5 stars\nI've had a LOT of phone cases in my life... this MAY be the best",
                "reviewer_name": "Chris P. Bacon",
                "review_date": "Reviewed in the United States on October 8, 2024",
                "review_text": "The fit and feel of this case is superior to any others I have ever had. The Mag Safe back is STRONG and effective. I am VERY pleased with my selection of this case for my iPhone 16 Pro. It has protected it in two or three minor falls, so far. I highly recommend it. I like the company so well that I purchased their back card attachment and Apple Watch Ultra protector."
            },
            {
                "review_title": "4.0 out of 5 stars\nGood case, but slippery",
                "reviewer_name": "Alex N",
                "review_date": "Reviewed in the United States on October 21, 2024",
                "review_text": "I used to have a silicone phone case, so compared to that phone case, this one seems to slip out of my hands more. However, it's good quality and fits my phone well. Looks very clean. Haven't dropped my phone while using the case yet so I cannot attest to how well it holds up from a fall."
            },
            {
                "review_title": "5.0 out of 5 stars\nNice cover, reasonably priced",
                "reviewer_name": "Coral Caper",
                "review_date": "Reviewed in the United States on October 23, 2024",
                "review_text": "Very pleased with this phone case. I got the clear and it is very nice. Seems to be hardy but I haven’t dropped my phone yet. Slim, not bulky, very fast delivery. Would buy again and would recommend to others."
            },
            {
                "review_title": "5.0 out of 5 stars\nFits and protects well.  Even works with lanyard patch.",
                "reviewer_name": "e_scouter",
                "review_date": "Reviewed in the United States on September 17, 2024",
                "review_text": "I like to use a lanyard patch with my phone because it provides a strong ring to attach a strap to.  I was hoping this case would allow my lanyard patch (the black piece at the bottom of the photo) to be used without being too tight, and it works great.The case fits snugly, but not too snug, and has a non-slip surface that should keep the phone from sliding on smooth surfaces.  Mine is clear, which I like.  The lip around the camera lenses is a great feature to keep them from getting scratched."
            }
        ]
    }
]